PmsProject/app/Controllers/User.php

    public function index()
    {
        $db = \Config\Database::connect();
        $user_id = session()->get('user_id');

        // Fetch citizen profile info joined with user record
        $data['citizen'] = $db->table('citizens')
            ->select('citizens.*, users.name, users.email')
            ->join('users', 'users.id = citizens.user_id')
            ->where('citizens.user_id', $user_id)
            ->get()
            ->getRowArray();

        // Fetch user's own applications
        $data['applications'] = $db->table('applications')->where('user_id', $user_id)->orderBy('applied_at', 'DESC')->limit(5)->get()->getResultArray();

        // Fetch user's own grievances
        $data['grievances'] = $db->table('grievances')->where('user_id', $user_id)->orderBy('created_at', 'DESC')->limit(3)->get()->getResultArray();

        $data['total_taxes_unpaid'] = $db->table('taxes')->where(['user_id' => $user_id, 'status' => 'Unpaid'])->countAllResults();

        // Fetch issued certificates for this user
        $data['issued_certificates'] = $db->table('birth_death_register')
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->get()
            ->getResultArray();
---
SELECT `citizens`.*, `users`.`name`, `users`.`email`
FROM `citizens`
JOIN `users` ON `users`.`id` = `citizens`.`user_id`
WHERE `citizens`.`user_id` = '10'
SELECT *
FROM `applications`
WHERE `user_id` = '10'
ORDER BY `applied_at` DESC
 LIMIT 5
SELECT *
FROM `grievances`
WHERE `user_id` = '10'
ORDER BY `created_at` DESC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `taxes`
WHERE `user_id` = '10'
AND `status` = 'Unpaid'
SELECT *
FROM `birth_death_register`
WHERE `linked_user_id` = '10'
AND `is_issued` = 1

        // Fetch Emergency Alerts for Broadcast
        $now = date('Y-m-d H:i:s');
        $user_ward = $data['citizen']['ward_no'] ?? 'All';
        $data['broadcast_alerts'] = $db->table('emergency_alerts')
            ->where('is_active', 1)
            ->groupStart()
                ->where('expiry_date >', $now)
                ->orWhere('expiry_date', null)
            ->groupEnd()
            ->groupStart()
                ->where('ward_no', 'All')
                ->orWhere('ward_no', $user_ward)
                ->orWhere('ward_no', 'Ward ' . str_pad($user_ward, 2, '0', STR_PAD_LEFT))
            ->groupEnd()
            ->orderBy('severity', 'DESC')
            ->get()->getResultArray();

        // Fetch active notices
        $data['notices'] = $db->table('notices')->where('status', 'Active')->orderBy('created_at', 'DESC')->limit(3)->get()->getResultArray();

        // Fetch latest/upcoming Gram Sabha meeting
        $data['next_meeting'] = $db->table('proceedings')->orderBy('meeting_date', 'DESC')->limit(1)->get()->getRowArray();
---
SELECT *
FROM `emergency_alerts`
WHERE `is_active` = 1
AND   (
`expiry_date` > '2026-04-23 19:58:24'
OR `expiry_date` IS NULL
 )
AND   (
`ward_no` = 'All'
OR `ward_no` = '07'
OR `ward_no` = 'Ward 07'
 )
ORDER BY `severity` DESC
SELECT *
FROM `notices`
WHERE `status` = 'Active'
ORDER BY `created_at` DESC
 LIMIT 3
SELECT *
FROM `proceedings`
ORDER BY `meeting_date` DESC
 LIMIT 1

    public function my_documents()
    {
        $db = \Config\Database::connect();
        $user_id = session()->get('user_id');

        // Fetch all certificates linked to this user
        $data['issued_certificates'] = $db->table('birth_death_register')
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `birth_death_register`
WHERE `linked_user_id` = '10'
AND `is_issued` = 1

    public function certificates()
    {
        $db = \Config\Database::connect();
        $user_id = session()->get('user_id');

        // Fetch count for sidebar
        $count = $db->table('birth_death_register')
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->countAllResults();

        $data['cert_count'] = $count;

        // Fetch issued certificates for this user to display prominent downloads
        $data['issued_certificates'] = $db->table('birth_death_register')
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->get()
            ->getResultArray();

        // Fetch application history
        $data['applications'] = $db->table('applications')
            ->where('user_id', $user_id)
            ->orderBy('applied_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `birth_death_register`
WHERE `linked_user_id` = '10'
AND `is_issued` = 1
SELECT *
FROM `birth_death_register`
WHERE `linked_user_id` = '10'
AND `is_issued` = 1
SELECT *
FROM `applications`
WHERE `user_id` = '10'
ORDER BY `applied_at` DESC

    public function profile()
    {
        $db = \Config\Database::connect();
        $user_id = session()->get('user_id');

        $data['citizen'] = $db->table('citizens')
            ->select('citizens.*, users.name, users.email, users.role')
            ->join('users', 'users.id = citizens.user_id')
            ->where('citizens.user_id', $user_id)
            ->get()
            ->getRowArray();
---
SELECT `citizens`.*, `users`.`name`, `users`.`email`, `users`.`role`
FROM `citizens`
JOIN `users` ON `users`.`id` = `citizens`.`user_id`
WHERE `citizens`.`user_id` = '10'

    public function view_certificate($id)
    {
        $db = \Config\Database::connect();
        $user_id = session()->get('user_id');

        $record = $db->table('birth_death_register')
            ->where('id', $id)
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `birth_death_register`
WHERE `id` = '22'
AND `linked_user_id` = '10'
AND `is_issued` = 1

    public function notices()
    {
        $db = \Config\Database::connect();
        $data['notices'] = $db->table('notices')
            ->where('status', 'Active')
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `notices`
WHERE `status` = 'Active'
ORDER BY `created_at` DESC