app/Controllers/Admin.php

SELECT `applications`.*, `users`.`name` as `user_name`
FROM `applications`
JOIN `users` ON `users`.`id` = `applications`.`user_id`
WHERE `service_type` IN ('Birth Certificate','Death Certificate','Income Certificate','Caste Certificate','Domicile Certificate')
ORDER BY `applied_at` DESC
SELECT `id`, `registration_no`, `person_name`, `type`
FROM `birth_death_register`
---
    public function cert_approvals()
    {
        $db = \Config\Database::connect();
        $data['apps'] = $db->table('applications')
            ->select('applications.*, users.name as user_name')
            ->join('users', 'users.id = applications.user_id')
            ->whereIn('service_type', ['Birth Certificate', 'Death Certificate', 'Income Certificate', 'Caste Certificate', 'Domicile Certificate'])
            ->orderBy('applied_at', 'DESC')
            ->get()
            ->getResultArray();

        $data['registry'] = $db->table('birth_death_register')->select('id, registration_no, person_name, type')->get()->getResultArray();

INSERT INTO `birth_death_register` (`registration_no`, `type`, `person_name`, `gender`, `father_mother_name`, `date_of_event`, `place_of_event`, `village_ward`, `age_at_event`, `linked_user_id`, `is_issued`, `remarks`, `weight_at_birth`, `cause_of_death`, `category`, `caste_name`, `sub_caste`, `religion`, `stay_duration`, `id_proof_no`, `annual_income`, `financial_year`, `profession`) VALUES ('CST/2026/002', 'Caste', 'MAYURI PATIL', 'Female', 'RAHUL PATIL & LALITA PATIL', '2001-02-15', 'BODARLI BURHANPUR MP', 'ward no 08', '', '10', 1, 'Generated from Application #29', '', '', 'OBC', 'Gurjar', NULL, 'Hindu', '', '', '', '2025-26', '')
UPDATE `applications` SET `status` = 'Approved', `certificate_id` = 22, `remarks` = 'Approved: Certificate Generated & Issued'
WHERE `id` = '29'
---
                'profession'         => $data['profession'] ?? null,
            ];

            $db->table('birth_death_register')->insert($recordData);
            $newRegId = $db->insertID();

            // --- Update application with final link ---
            $db->table('applications')->where('id', $id)->update([
                'status'         => 'Approved',
                'certificate_id' => $newRegId,
                'remarks'        => 'Approved: Certificate Generated & Issued'
            ]);