app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'krishna@panchayat.com'
 LIMIT 1
---
    public function process()
    {
        $userModel = new \App\Models\UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();