app/Controllers/User.php

    public function index()
    {
        $db = \Config\Database::connect();
        $user_id = session()->get('user_id');

        // Fetch citizen profile info joined with user record
        $data['citizen'] = $db->table('citizens')
            ->select('citizens.*, users.name, users.email')
            ->join('users', 'users.id = citizens.user_id')
            ->where('citizens.user_id', $user_id)
            ->get()
            ->getRowArray();

        // Fetch user's own applications
        $data['applications'] = $db->table('applications')->where('user_id', $user_id)->orderBy('applied_at', 'DESC')->limit(5)->get()->getResultArray();

        // Fetch user's own grievances
        $data['grievances'] = $db->table('grievances')->where('user_id', $user_id)->orderBy('created_at', 'DESC')->limit(3)->get()->getResultArray();

        $data['total_taxes_unpaid'] = $db->table('taxes')->where(['user_id' => $user_id, 'status' => 'Unpaid'])->countAllResults();

        // Fetch issued certificates for this user
        $data['issued_certificates'] = $db->table('birth_death_register')
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->get()
            ->getResultArray();
---
SELECT `citizens`.*, `users`.`name`, `users`.`email`
FROM `citizens`
JOIN `users` ON `users`.`id` = `citizens`.`user_id`
WHERE `citizens`.`user_id` = '10'
SELECT *
FROM `applications`
WHERE `user_id` = '10'
ORDER BY `applied_at` DESC
 LIMIT 5
SELECT *
FROM `grievances`
WHERE `user_id` = '10'
ORDER BY `created_at` DESC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `taxes`
WHERE `user_id` = '10'
AND `status` = 'Unpaid'
SELECT *
FROM `birth_death_register`
WHERE `linked_user_id` = '10'
AND `is_issued` = 1

        // Fetch Emergency Alerts for Broadcast
        $now = date('Y-m-d H:i:s');
        $user_ward = $data['citizen']['ward_no'] ?? 'All';
        $data['broadcast_alerts'] = $db->table('emergency_alerts')
            ->where('is_active', 1)
            ->groupStart()
                ->where('expiry_date >', $now)
                ->orWhere('expiry_date', null)
            ->groupEnd()
            ->groupStart()
                ->where('ward_no', 'All')
                ->orWhere('ward_no', $user_ward)
                ->orWhere('ward_no', 'Ward ' . str_pad($user_ward, 2, '0', STR_PAD_LEFT))
            ->groupEnd()
            ->orderBy('severity', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `emergency_alerts`
WHERE `is_active` = 1
AND   (
`expiry_date` > '2026-04-23 19:58:47'
OR `expiry_date` IS NULL
 )
AND   (
`ward_no` = 'All'
OR `ward_no` = '07'
OR `ward_no` = 'Ward 07'
 )
ORDER BY `severity` DESC

    public function my_documents()
    {
        $db = \Config\Database::connect();
        $user_id = session()->get('user_id');

        // Fetch all certificates linked to this user
        $data['issued_certificates'] = $db->table('birth_death_register')
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `birth_death_register`
WHERE `linked_user_id` = '10'
AND `is_issued` = 1

    public function certificates()
    {
        $db = \Config\Database::connect();
        $user_id = session()->get('user_id');

        // Fetch count for sidebar
        $count = $db->table('birth_death_register')
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->countAllResults();

        $data['cert_count'] = $count;

        // Fetch issued certificates for this user to display prominent downloads
        $data['issued_certificates'] = $db->table('birth_death_register')
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->get()
            ->getResultArray();

        // Fetch application history
        $data['applications'] = $db->table('applications')
            ->where('user_id', $user_id)
            ->orderBy('applied_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `birth_death_register`
WHERE `linked_user_id` = '10'
AND `is_issued` = 1
SELECT *
FROM `birth_death_register`
WHERE `linked_user_id` = '10'
AND `is_issued` = 1
SELECT *
FROM `applications`
WHERE `user_id` = '10'
ORDER BY `applied_at` DESC

    public function submit_application()
    {
        $db = \Config\Database::connect();
        $formData = $this->request->getPost('data');
        $formData['purpose'] = $this->request->getPost('purpose');

        $data = [
            'user_id'          => session()->get('user_id'),
            'service_type'     => $this->request->getPost('service_type'),
            'status'           => 'Pending',
            'application_data' => json_encode($formData),
            'applied_at'       => date('Y-m-d H:i:s')
        ];
        $db->table('applications')->insert($data);
---
INSERT INTO `applications` (`user_id`, `service_type`, `status`, `application_data`, `applied_at`) VALUES ('10', 'Caste Certificate', 'Pending', '{\"person_name\":\"MAYURI PATIL\",\"gender\":\"Female\",\"date_of_event\":\"2001-02-15\",\"place_of_event\":\"BODARLI BURHANPUR MP\",\"village_ward\":\"ward no 08\",\"category\":\"OBC\",\"caste_name\":\"Gurjar\",\"religion\":\"Hindu\",\"financial_year\":\"2025-26\",\"father_name\":\"RAHUL PATIL\",\"mother_name\":\"LALITA PATIL\",\"weight_at_birth\":\"\",\"age_at_event\":\"\",\"cause_of_death\":\"\",\"profession\":\"\",\"annual_income\":\"\",\"stay_duration\":\"\",\"id_proof_no\":\"\",\"purpose\":\"LEGAL WORK\"}', '2026-04-21 18:27:40')

    public function view_certificate($id)
    {
        $db = \Config\Database::connect();
        $user_id = session()->get('user_id');

        $record = $db->table('birth_death_register')
            ->where('id', $id)
            ->where('linked_user_id', $user_id)
            ->where('is_issued', 1)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `birth_death_register`
WHERE `id` = '15'
AND `linked_user_id` = '10'
AND `is_issued` = 1